Revit 2027 API
StairsComponentConnectionEndType Enumeration
 The end type identifying the connection type among stairs runs and landings.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsComponentConnectionEndType
Public Enumeration StairsComponentConnectionEndType
public enum class StairsComponentConnectionEndType
type StairsComponentConnectionEndType
Members
Member name | Value | Description
ET_Landing | 0 |  A connection to the boundary of a stairs landing.
ET_RunEnd | 2 |  A connection to the end (upper end) of a stairs run.
ET_RunStart | 1 |  A connection to the start (lower end) of a stairs run.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace